*Note:* [Pandas_Cheat_Sheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)

In [0]:
#Upload a file to my Google Drive. (I'm using Google Colab.)
from google.colab import files
uploaded = files.upload()

Saving train.csv to train.csv

In [0]:
#And run this cell to make another cell(s) work properly.
import numpy as np
import pandas as pd
import io

**Quiz1**

โหลด csv เข้าไปใน Python Pandas

In [0]:
#Quiz1

df = pd.read_csv('https://gist.githubusercontent.com/deen666/aaf734fe721ca1bf504d324bf76eef04/raw/8f990dffacaf13cff911a86d4bc944be3b0d0486/train.csv') #Use the local filepath or url link to read or fetch the .csv file.
#df = pd.read_csv(io.BytesIO(uploaded['train.csv']))  #I'm using the uploaded .csv file on my GDrive.
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

**Quiz2**

เขียนโค้ดแสดง หัว10แถว ท้าย10แถว และสุ่ม10แถว

In [0]:
#Quiz2
df.head(10)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]

In [0]:
#Quiz2
df.tail(10)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
881          882         0       3  ...   7.8958   NaN         S
882          883         0       3  ...  10.5167   NaN         S
883          884         0       2  ...  10.5000   NaN         S
884          885         0       3  ...   7.0500   NaN         S
885          886         0       3  ...  29.1250   NaN         Q
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[10 rows x 12 columns]

In [0]:
#Quiz2
df.sample(10)

     PassengerId  Survived  Pclass  ...      Fare        Cabin  Embarked
863          864         0       3  ...   69.5500          NaN         S
573          574         1       3  ...    7.7500          NaN         Q
379          380         0       3  ...    7.7750          NaN         S
660          661         1       1  ...  133.6500          NaN         S
582          583         0       2  ...   26.0000          NaN         S
341          342         1       1  ...  263.0000  C23 C25 C27         S
110          111         0       1  ...   52.0000         C110         S
566          567         0       3  ...    7.8958          NaN         S
97            98         1       1  ...   63.3583      D10 D12         C
348          349         1       3  ...   15.9000          NaN         S

[10 rows x 12 columns]

**Quiz3**

ลบ row ที่มี Embarked ว่าง

In [0]:
#Quiz3
df2 = df.dropna(subset=['Embarked'])
print(df2)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[889 rows x 12 columns]

**Quiz4**

เติม age ด้วยค่าเฉลี่ย

In [0]:
#Quiz4
avg = df2['Age'].mean()
print(avg)

df3 = df2.copy() #https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
df3['Age'].fillna(value = avg, inplace=True)
df3

29.64209269662921

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[889 rows x 12 columns]

**Quiz5**

เติม age ด้วย 0

In [0]:
#Quiz5
df4 = df2.copy()
df4['Age'].fillna(value = 0, inplace=True)
df4

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[889 rows x 12 columns]

**Quiz6**

ลบ row ที่ age เป็นค่าว่าง

In [0]:
#Quiz6 
df.dropna(subset=['Age'], inplace=True)
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
885          886         0       3  ...  29.1250   NaN         Q
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[714 rows x 12 columns]

**Quiz7**

หาจำนวนผู้หญิงต่อผู้ชายที่อยู่บนเรือ

In [3]:
ori_df = pd.read_csv('https://gist.githubusercontent.com/deen666/aaf734fe721ca1bf504d324bf76eef04/raw/8f990dffacaf13cff911a86d4bc944be3b0d0486/train.csv')   #Original Data Frame 
ori_df['Sex'].value_counts()  

#ori_df['Sex'].unique()  #Find the unique or distinct name in columm Sex.

male      577
female    314
Name: Sex, dtype: int64

In [0]:

cleaning_df = df.copy()
cleaning_df['Sex'].value_counts() #DataFrame from Quiz6 (with data cleaning.)

male      453
female    261
Name: Sex, dtype: int64

In [5]:
#Quiz 7
F = (ori_df['Sex'] == 'female').sum()
M = (ori_df['Sex'] == 'male').sum()
ratio = F/M
print(ratio)

0.5441941074523396

**Quiz8**

หาจำนวนผู้หญิงและผู้ชายที่รอดชีวิต

	Survived (1) or died (0)*

In [8]:
#Quiz8 

survived_group = ori_df.groupby(['Sex'])['Survived'].sum()
print (survived_group)

Sex
female    233
male      109
Name: Survived, dtype: int64

**Quiz9**

หา % การรอดชีวิตของผู้หญิงและผู้ชาย

In [38]:
#Quiz9
#(required variable from quiz7)
#total_group = ori_df.groupby(['Sex'])['Survived'].count()
#survived_group = ori_df.groupby(['Sex'])['Survived'].sum()

SF = ((ori_df['Survived'] == 1) & (ori_df['Sex'] == 'female')).sum()
SM = ((ori_df['Survived'] == 1) & (ori_df['Sex'] == 'male')).sum()

print('Female Survival rate =',SF/F*100)
print('Male Survival rate =',SM/M*100)

Female Survival rate = 74.20382165605095
Male Survival rate = 18.890814558058924